In [1]:
import pandas as pd

In [15]:
df = pd.read_csv('http://bit.ly/kaggletrain')  
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [16]:
df.shape

(891, 12)

In [17]:
df = df[df.Age < df.Age.quantile(.99)]  
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S

In [18]:
df.shape

(706, 12)

In [19]:
df['Age'].fillna(df.Age.median(), inplace=True)

In [20]:
df.Age.head(10)

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
Name: Age, dtype: float64

In [21]:
df.loc[:10, 'Age']

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
Name: Age, dtype: float64

In [10]:
?pd.cut

In [22]:
[df.Age.min(), 18, 40, df.Age.max()]

[0.42, 18, 40, 65.0]

In [23]:
# cut bins data
# binning Age from min (0.42) to 18 then 18 to 40 then 40 to max (65.0).
# these binnings are given labels, Underage is < 18, Young is > 18 and < 40, Experienced is > 40 yrs 
df['Age'] = pd.cut(df['Age'],  
                 bins=[df.Age.min(), 18, 40, df.Age.max()],
                 labels=['Underage', 'Young', 'Experienced'])

In [24]:
df.loc[:10, 'Age']

0           Young
1           Young
2           Young
3           Young
4           Young
6     Experienced
7        Underage
8           Young
9        Underage
10       Underage
Name: Age, dtype: category
Categories (3, object): [Underage < Young < Experienced]

In [26]:
df['Sex'].replace({'female': 1, 'male': 0}, inplace=True)

In [14]:
# Replace 'female' with 1 and 'male' with 0
# could also use .replace({'female': 1, 'male': 0}, inplace=True)  
df['Sex'] = df['Sex'].replace({'female': 1, 'male': 0})

In [30]:
df.Sex.head(10)

0     0
1     1
2     1
3     1
4     0
6     0
7     0
8     1
9     1
10    1
Name: Sex, dtype: int64

In [31]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,Young,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,Young,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,Young,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,Young,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,Young,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",0,Experienced,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",0,Underage,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",1,Young,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",1,Underage,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",1,Underage,1,1,PP 9549,16.7000,G6,S

In [67]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,Young,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,Young,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,Young,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,Young,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,Young,0,0,373450,8.0500,NaN,S

    pandas.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All')[source]
    
    values -- column to aggregate
    
    index -- column, Grouper, array, or list of the previous
            If an array is passed, it must be the same length as the data. The list can contain any of the other types (except list). Keys to group by on the pivot table index. If an array is passed, it is being used as the same manner as column values.
            
    columns -- column, Grouper, array, or list of the previous
            If an array is passed, it must be the same length as the data. The list can contain any of the other types (except list). Keys to group by on the pivot table column. If an array is passed, it is being used as the same manner as column values.

In [116]:
ser = df.groupby(['Age', 'Pclass']).Sex.mean()

In [117]:
ser

Age          Pclass
Underage     1         0.687500
             2         0.482759
             3         0.462366
Young        1         0.510638
             2         0.427273
             3         0.226244
Experienced  1         0.361111
             2         0.406250
             3         0.236842
Name: Sex, dtype: float64

In [118]:
ser.unstack()

Pclass              1         2         3
Age
Underage     0.687500  0.482759  0.462366
Young        0.510638  0.427273  0.226244
Experienced  0.361111  0.406250  0.236842

In [105]:
df.pivot_table(values='Sex', index='Age', columns='Pclass', aggfunc='mean')

Pclass              1         2         3
Age
Underage     0.687500  0.482759  0.462366
Young        0.510638  0.427273  0.226244
Experienced  0.361111  0.406250  0.236842

In [106]:
df.pivot_table(values='Sex', index='Pclass', columns='Age', aggfunc='mean')

Age     Underage     Young  Experienced
Pclass
1       0.687500  0.510638     0.361111
2       0.482759  0.427273     0.406250
3       0.462366  0.226244     0.236842

In [ ]:
df.loc[:, []]

In [88]:
k.Pclass

In [100]:
df.loc[:, ['Pclass','Sex', 'Age']].groupby('Pclass').Sex.mean()
#.groupby('Age').mean().set_index('Pclass')

Pclass
1    0.467033
2    0.432749
3    0.288952
Name: Sex, dtype: float64

In [ ]:
df.set_index('')

In [70]:
df.groupby('Age').Sex.mean()

Age
Underage       0.492754
Young          0.341176
Experienced    0.338028
Name: Sex, dtype: float64

In [69]:
?df.slice_shift

In [40]:
kim = df.pivot_table(values='Sex', columns='Pclass', index='Age')

In [41]:
kim

Pclass              1         2         3
Age
Underage     0.687500  0.482759  0.462366
Young        0.510638  0.427273  0.226244
Experienced  0.361111  0.406250  0.236842

In [49]:
Underage     = df[df.Age == 'Underage']
Young        = df[df.Age == 'Young']
Experienced  = df[df.Age == 'Experienced']

In [63]:
Young.Pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [59]:
Young.Pclass.value_counts(normalize=True)

3    0.520000
2    0.258824
1    0.221176
Name: Pclass, dtype: float64

In [57]:
Young.Pclass.value_counts(normalize=True)

3    0.520000
2    0.258824
1    0.221176
Name: Pclass, dtype: float64

In [58]:
Experienced.Pclass.value_counts(normalize=True)

1    0.507042
3    0.267606
2    0.225352
Name: Pclass, dtype: float64

In [54]:
?Experienced.Pclass.value_counts

In [48]:
Underage.shape

(138, 12)

In [33]:
df.pivot_table(values='Sex', columns='Pclass', index='Age', aggfunc='mean')

Pclass              1         2         3
Age
Underage     0.687500  0.482759  0.462366
Young        0.510638  0.427273  0.226244
Experienced  0.361111  0.406250  0.236842

In [ ]:
df = df.pivot_table(values='Sex', columns='Pclass', index='Age', aggfunc='mean')

In [ ]:
df = df.rename_axis('', axis='columns')  
df = df.rename('Class {}'.format, axis='columns')  
df.style.format('{:.2%}')